package _小知识_._oauth2_;

/**
 * @author HJC
 * @version 1.0
 * 谦谦君子 卑以自牧也
 * @date 2020/6/11  12:18
 * @description :
 */
public class Init {


    /*
    *
    * oauth2.0
    * 第三方服务认证服务
    *
    * 资源服务器
    * 客户端
    * 认证服务
    *
    * 1、客户端申请资源授权 （login）
    * 2、得到许可(auth)
    * 3、客户端申请令牌(token)
    * 3、客户端得到令牌
    * 4、客户端使用令牌访问资源
    * 5、资源与认证端确认令牌（token一致，过期 403）
    * 6、返回保护资源（SUCCESS 200）
    *
    *
    * 授权：
    *
    * 授权码模式
    *
    * 简化模式 （token 发放给 服务器，由服务器管理）
    *
    *
    *
    *
    * */
}
